//----------------------------------------------------------------------------
//    프로그램명 	: IWDG 관련 함수
//
//    만든이     	: Cho Han Cheol(Baram)
//
//    날  짜     	: 
//    
//    최종 수정  	:
//
//    MPU_Type	:
//
//    파일명     	: Hw_IWDG.c
//----------------------------------------------------------------------------


//----- 헤더파일 열기
//
#define  HW_IWDG_LOCAL


#include "Hw_IWDG.h"





/*---------------------------------------------------------------------------
     TITLE   : Hw_IWDG_Init
     WORK    : 
     ARG     : void
     RET     : void
---------------------------------------------------------------------------*/
void Hw_IWDG_Init( void )
{

}





/*---------------------------------------------------------------------------
     TITLE   : Hw_IWDG_GoToBoot
     WORK    : 
     ARG     : void
     RET     : void
---------------------------------------------------------------------------*/
void Hw_IWDG_GoToBoot( void )
{
	REG_IWDG_PR  = 0;	   // divider / 4
	REG_IWDG_RLR = 1;

	REG_IWDG_KR  = 0xCCCC; // Start
}

